Revit 2026 API

# PerformanceAdviserExecuteAllRules Method

---

Executes all rules in the list on a given document.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public IList<FailureMessage> ExecuteAllRules(
	Document document
)
```
```vb
Public Function ExecuteAllRules (
	document As Document
) As IList(Of FailureMessage)
```
```cpp
public:
IList<FailureMessage^>^ ExecuteAllRules(
	Document^ document
)
```
```fsharp
member ExecuteAllRules :
        document : Document -> IList<FailureMessage>
```

#### Parameters

document Document
     Document on which the rules will be executed.

#### Return Value

IListFailureMessage Failure messages explaining performance problems detected in the document.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

Disabled rules are not executed.

#### Reference

PerformanceAdviser Class

Autodesk.Revit.DB Namespace